# Base Homebrew Bundle
# Essential tools and utilities for all macOS setups
# This Brewfile contains the core packages needed for basic functionality

#=============================================================================
# TAPS - Third-party repositories
#=============================================================================

# Note: homebrew/bundle and homebrew/services are now part of Homebrew core
tap "ttscoff/thelab"

#=============================================================================
# FORMULAE - Command-line tools
#=============================================================================

# Essential system tools
brew "git"                    # Version control system
brew "zsh"                    # Modern shell (may be system default)
brew "curl"                   # HTTP client
brew "wget"                   # File downloader
brew "openssh"                # SSH client/server

# Modern CLI replacements
brew "eza"                    # Modern ls replacement
brew "bat"                    # Better cat with syntax highlighting
brew "fd"                     # Modern find replacement
brew "ripgrep"                # Fast grep replacement
brew "fzf"                    # Fuzzy finder for everything
brew "zoxide"                 # Smart cd replacement

# Essential utilities
brew "tree"                   # Directory tree visualizer
brew "htop"                   # Better top/process viewer
brew "gdu"                    # Disk usage analyzer
brew "tldr"                   # Simplified man pages

# Archive and compression
brew "unzip"                  # ZIP file extraction
brew "p7zip"                  # 7-Zip archive utility
brew "xz"                     # XZ compression

# Network tools
brew "nmap"                   # Network mapping tool
brew "speedtest-cli"          # Internet speed test
brew "HTTPie"                 # HTTP client

# Text processing
brew "grep"                   # GNU grep (better than BSD)
brew "sed"                    # GNU sed (better than BSD)
brew "awk"                    # GNU awk (better than BSD)
brew "jq"                     # JSON processor
brew "yq"                     # YAML processor
brew "csvkit"                 # CSV toolkit
brew "mdv"                    # Markdown viewer
brew "mdless"                 # Markdown viewer
brew "mandown"                # Markdown to man page converter
brew "man2html"               # Man page to HTML converter
brew "man2pdf"                # Man page to PDF converter
brew "gather-cli"             # Gather CLI tool

# Image and Video
brew "yt-dlp"                 # YouTube downloader
brew "ffmpeg"                 # Video and audio converter
brew "imagemagick"            # Image manipulation
brew "exiftool"               # EXIF metadata editor
brew "mpv"                    # Video player

# Shell enhancements
brew "shellcheck"             # Shell script linter
brew "shfmt"                  # Shell script formatter

# Python development (modern toolchain)
brew "uv"                     # Ultra-fast Python package manager and project tool
brew "ruff"                   # Extremely fast Python linter and formatter

# Productivity
brew "taskwarrior"            # Task management tool
brew "todo-txt"               # Todo.txt command-line wnterface
brew "calcurse"               # Calender and task management tool


#=============================================================================
# CASKS - GUI Applications
#=============================================================================

# Essential productivity
cask "1password"              # Password manager
cask "raycast"                # Application launcher and productivity
cask "karabiner-elements"     # Keyboard customisation
cask "zen"                    # Firefox based browser
cask "marta"                  # Dual pane file manager

# Communication
cask "zoom"                   # Video conferencing
cask "slack"                  # Team communication

# Utilities
cask "appcleaner"             # Application uninstaller
cask "the-unarchiver"         # Archive extraction utility
cask "keka"                   # Archive creation utility
cask "iina"                   # Video player

# System utilities
cask "coconutbattery"         # Battery health monitoring

#=============================================================================
# MAS - Mac App Store Applications
#=============================================================================

# System utilities from App Store
# mas "Hidden Bar", id: 1452453066                    # Menu bar organization
