# Mac Studio Hardware-Specific Brewfile
# High-performance, always-on server and development workstation
# Optimized for M1 Max with 32GB RAM - power and performance focused

#=============================================================================
# TAPS - Server and high-performance tools
#=============================================================================

# Note: homebrew/services is now part of Homebrew core
tap "nginx/stable"
tap "mongodb/brew"
tap "elastic/tap"

#=============================================================================
# ALWAYS-ON SERVER TOOLS
#=============================================================================

# Web servers and reverse proxies
brew "nginx"                  # High-performance web server
brew "caddy"                  # Modern web server with automatic HTTPS
brew "haproxy"                # Load balancer and proxy server

# Database servers (optimized for always-on)
brew "postgresql@17"          # PostgreSQL with auto-start
brew "mysql"                  # MySQL database server
brew "redis"                  # In-memory data store
brew "mongodb/brew/mongodb-community"  # MongoDB document database
brew "clickhouse"             # Columnar analytics database

# Search and analytics
brew "elasticsearch"          # Full-text search engine
brew "kibana"                 # Elasticsearch visualization
brew "logstash"               # Data processing pipeline

# Message queues and streaming
brew "apache-kafka"           # Distributed streaming platform
brew "rabbitmq"               # Message broker

#=============================================================================
# HIGH-PERFORMANCE DEVELOPMENT TOOLS
#=============================================================================

# Container orchestration (resource-intensive)
brew "kubernetes-cli"         # Kubernetes command line
brew "helm"                   # Kubernetes package manager
brew "kind"                   # Kubernetes in Docker
brew "minikube"               # Local Kubernetes cluster

# Build and CI/CD tools
brew "jenkins"                # Automation server
brew "bazel"                  # Google's build tool
brew "buck2"                  # Meta's build system

# Performance monitoring and profiling
brew "htop"                   # Enhanced process viewer
brew "iotop"                  # I/O monitoring
brew "nload"                  # Network usage monitor
brew "iftop"                  # Network bandwidth monitor
brew "bandwhich"              # Network bandwidth monitor per process

# Python development (modern toolchain)
brew "uv"                     # Ultra-fast Python package manager and project tool
brew "ruff"                   # Extremely fast Python linter and formatter

# Memory and performance analysis
brew "valgrind"               # Memory debugging (Intel only)
brew "hyperfine"              # Command-line benchmarking
brew "pv"                     # Pipe viewer with progress

#=============================================================================
# DATA PROCESSING & ANALYTICS (HIGH-MEMORY)
#=============================================================================

# Big data processing
brew "apache-spark"           # Unified analytics engine
brew "apache-hadoop"          # Distributed storage and computing
brew "apache-airflow"         # Workflow management

# Time-series databases
brew "influxdb"               # Time-series database
brew "grafana"                # Monitoring and observability

#=============================================================================
# DEVELOPMENT DATABASES & STORAGE
#=============================================================================

# Graph databases
brew "neo4j"                  # Graph database

# Vector databases for AI/ML
brew "milvus"                 # Vector database (if available)

# File systems and storage
brew "rclone"                 # Cloud storage sync
brew "restic"                 # Backup program
brew "borgbackup"             # Deduplicating backup

# Network file sharing services
brew "netatalk"               # Apple Filing Protocol (AFP) server
brew "samba"                  # SMB/CIFS file sharing
brew "nfs-utils"              # Network File System
brew "avahi"                  # mDNS/Bonjour service discovery

#=============================================================================
# SYSTEM ADMINISTRATION TOOLS
#=============================================================================

# Network and system monitoring
brew "wireshark"              # Network protocol analyzer
brew "nmap"                   # Network discovery and security auditing
brew "tcpdump"                # Network packet analyzer
brew "netcat"                 # Network utility

# Process and system management
brew "supervisor"             # Process control system
brew "monit"                  # System monitoring

# Security scanning
brew "nmap"                   # Network mapper
brew "sqlmap"                 # SQL injection scanner
brew "nikto"                  # Web vulnerability scanner

#=============================================================================
# COMPILER TOOLCHAINS & RUNTIMES
#=============================================================================

# Multiple language versions for compatibility testing
brew "python@3.9"            # Python 3.9 for legacy support
brew "python@3.10"           # Python 3.10
brew "python@3.11"           # Python 3.11 LTS
brew "python@3.12"           # Python 3.12 latest

# Java ecosystem
brew "openjdk@8"              # Java 8 for legacy apps
brew "openjdk@11"             # Java 11 LTS
brew "openjdk@17"             # Java 17 LTS
brew "openjdk@21"             # Java 21 LTS

# Alternative runtimes
brew "graalvm/tap/graalvm-ce" # High-performance JVM

#=============================================================================
# VIRTUALIZATION & EMULATION
#=============================================================================

# VM and container tools
brew "qemu"                   # Machine emulator and virtualizer
brew "lima"                   # Linux virtual machines
brew "podman"                 # Alternative to Docker

#=============================================================================
# GUI APPLICATIONS FOR DEVELOPMENT SERVER
#=============================================================================

# Remote access and management
cask "vnc-viewer"             # VNC client for remote access
cask "screens"                # Screen sharing and remote desktop
cask "teamviewer"             # Remote access and support

# Server monitoring and management
cask "proxyman"               # Web debugging proxy
cask "wireshark"              # Network analysis GUI
cask "sequel-pro"             # MySQL database management
cask "mongodb-compass"        # MongoDB GUI
cask "tableplus"              # Universal database tool

# Development IDEs (full suite for workstation)
cask "jetbrains-toolbox"      # Complete JetBrains IDE suite
cask "visual-studio"          # Microsoft Visual Studio
cask "xcode"                  # Apple's complete development suite

# Container management
cask "orbstack"               # Fast, lightweight container runtime (primary)
# cask "docker"               # Docker Desktop (disabled in favour of OrbStack)

#=============================================================================
# PERFORMANCE MONITORING APPLICATIONS
#=============================================================================

# System monitoring
cask "stats"                  # System stats in menu bar
cask "istat-menus"            # Advanced system monitoring
cask "activity-monitor"       # Enhanced Activity Monitor

# Network monitoring
cask "little-snitch"          # Network monitoring and firewall
cask "radio-silence"          # Network monitor

#=============================================================================
# AUTOMATION & PRODUCTIVITY FOR ALWAYS-ON SYSTEM
#=============================================================================

# Automation tools
brew "ansible"                # Configuration management
brew "terraform"              # Infrastructure as code
cask "hazel"                  # Automated file organization

# Backup and sync (server-grade)
cask "arq"                    # Cloud backup
cask "carbon-copy-cloner"     # Disk cloning and backup

#=============================================================================
# NETWORK SERVER CONFIGURATION
#=============================================================================

# Shared folder structure to be created:
# /Users/Shared/Studio-Server/
# ├── Development/          # Shared development projects
# ├── Media/               # Media files (photos, videos, music)
# ├── Documents/           # Shared documents and files
# ├── Backups/             # Backup storage
# └── Software/            # Software installers and packages

#=============================================================================
# SERVICES TO AUTO-START (Mac Studio Network Server)
#=============================================================================

# Core database and application services
# - postgresql@17         (Database server)
# - redis                 (Cache and session storage)
# - mongodb-community     (Document database)
# - nginx                 (Web server and reverse proxy)

# Network file sharing services
# - netatalk              (AFP file sharing for macOS devices)
# - smbd                  (SMB/CIFS for cross-platform sharing)
# - nfs-utils             (NFS for Unix-like systems)
# - avahi-daemon          (Service discovery/Bonjour)

# Optional monitoring and analytics
# - elasticsearch         (Log aggregation and search)
# - grafana              (Monitoring dashboards)

# Time Machine server
# - Time Machine sharing enabled for network backups