# macOS Setup Automation - Mac Mini Brewfile
# Lightweight development + multimedia system configuration

brew "ffmpeg"           # Multimedia processing framework
brew "youtube-dl"       # Video download utility
brew "yt-dlp"           # Enhanced youtube-dl fork
brew "tmux"             # Terminal multiplexer
brew "neovim"           # Modern vim for configuration editing
brew "git-lfs"          # Git Large File Storage for media files
brew "gh"               # GitHub CLI for repository management
brew "mosquitto"        # MQTT message broker for IoT devices
brew "nmap"             # Network device discovery
brew "arp-scan"         # ARP packet scanner for device detection
brew "rsync"            # File synchronisation
brew "rclone"           # Cloud storage synchronisation
brew "htop"             # Process monitoring

cask "iina"             # Modern media player for macOS
cask "vlc"              # Universal media player with extensive codec support
cask "mpv"              # Minimalist command-line media player
cask "plex"             # Media server and streaming platform
cask "audacity"         # Multi-track audio editor
cask "google-chrome"    # Chrome for web compatibility testing
cask "firefox"          # Firefox for development and media streaming
cask "jump-desktop-connect"  # Remote access server for headless-like operation
cask "tailscale"        # Secure network mesh for home automation
cask "vnc-viewer"       # VNC client for device management
cask "visual-studio-code"  # Lightweight IDE for scripts and configuration
cask "home-assistant"   # Open-source home automation platform
cask "lan-scan"         # Network scanner with GUI
cask "spotify"          # Music streaming
cask "discord"          # Community chat and voice
cask "zoom"             # Video conferencing
cask "steam"            # Gaming platform
cask "imageoptim"       # Image compression and optimisation

mas "Apple Arcade", id: 1496833156  # Apple's gaming subscription
mas "Infuse 7", id: 1136220934      # Premium video player
mas "Airmail 5", id: 1373694562     # Email client
mas "Home", id: 1110145103          # HomeKit management
mas "Console", id: 1000000098       # System log viewer