# macOS Setup Automation - MacBook Pro Brewfile
# Portable development workstation configuration

brew "ios-deploy"       # Deploy and debug iOS apps from command line
brew "xcodes"           # Xcode version management
brew "fastlane"         # iOS and Android deployment automation
brew "tmux"             # Terminal multiplexer for session management
brew "neovim"           # Modern vim implementation for terminal editing
brew "mosh"             # Mobile shell for unstable connections

cask "jump-desktop"     # Remote desktop client for accessing other Macs
cask "tailscale"        # Secure network connectivity mesh
cask "affinity-designer"   # Vector design and illustration
cask "affinity-photo"      # Photo editing and manipulation
cask "affinity-publisher"  # Desktop publishing and layout
cask "syncthing"        # Continuous file synchronisation
cask "google-chrome"    # Chrome for web development testing
cask "firefox"          # Firefox for cross-browser compatibility
cask "safari-technology-preview"  # Latest Safari features
cask "slack"            # Team communication
cask "zoom"             # Video conferencing
cask "discord"          # Community and team chat
cask "spotify"          # Music streaming
cask "vlc"              # Universal media player

mas "Xcode", id: 497799835          # Apple's development environment
mas "TestFlight", id: 899247664     # iOS app beta testing
mas "Amphetamine", id: 937984704    # Prevent system sleep during work